In [66]:
import pandas as pd
import re
import numpy as np

In [22]:
def split_formula(s):
    t = re.findall(r'[\d+<\.\d+>?]+|[a-zA-Z]+',s)
    u = pd.DataFrame(t)
    v = u.T
    display(v)

In [3]:
Formular1 = "FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1"
split_formula(Formular1)

   0    1   2    3    4    5   6    7   8    9   10   11 12   13 14 15
0  FA  0.2  MA  0.7  APA  0.1  Pb  0.8  Sn  0.2  Cl  0.9  F  1.1  I  1

In [39]:
data = pd.DataFrame([['James', 'FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1'],['Sam', ' CH3NH3PbI3'], ['Billy', '(CH3NH3)PbI3'], ['Sarah', '(CH5N2)SnI3'], ['Felix', 'MAPbBr3']], columns=['Name', 'formula'])

In [5]:
data

    Name                                formula
0  James  FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1
1    Sam                             CH3NH3PbI3
2  Billy                           (CH3NH3)PbI3
3  Sarah                            (CH5N2)SnI3
4  Felix                                MAPbBr3

In [12]:
split_formula(data.formula.iloc[1])

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

In [42]:
data['formula-split']=data.formula.apply(split_formula)
data

   0    1   2    3    4    5   6    7   8    9   10   11 12   13 14 15
0  FA  0.2  MA  0.7  APA  0.1  Pb  0.8  Sn  0.2  Cl  0.9  F  1.1  I  1

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1  2  3    4  5
0  CH  5  N  2  SnI  3

        0  1
0  MAPbBr  3

    Name                                formula formula-split
0  James  FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1          None
1    Sam                             CH3NH3PbI3          None
2  Billy                           (CH3NH3)PbI3          None
3  Sarah                            (CH5N2)SnI3          None
4  Felix                                MAPbBr3          None

In [43]:
data = pd.DataFrame([['James', 'FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1'],['Sam', ' CH3NH3PbI3'], ['Billy', '(CH3NH3)PbI3'], ['Sarah', '(CH5N2)SnI3'], ['Felix', 'MAPbBr3']], columns=['Name', 'formula'])

In [44]:
data

    Name                                formula
0  James  FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1
1    Sam                             CH3NH3PbI3
2  Billy                           (CH3NH3)PbI3
3  Sarah                            (CH5N2)SnI3
4  Felix                                MAPbBr3

In [45]:
data['formula-split']=data.formula.apply(split_formula)
data['formula-split']

   0    1   2    3    4    5   6    7   8    9   10   11 12   13 14 15
0  FA  0.2  MA  0.7  APA  0.1  Pb  0.8  Sn  0.2  Cl  0.9  F  1.1  I  1

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1  2  3    4  5
0  CH  5  N  2  SnI  3

        0  1
0  MAPbBr  3

0    None
1    None
2    None
3    None
4    None
Name: formula-split, dtype: object

In [52]:
data = pd.DataFrame([['James', 'FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1'],['Sam', ' CH3NH3PbI3'], ['Billy', '(CH3NH3)PbI3'], ['Sarah', '(CH5N2)SnI3'], ['Felix', 'MAPbBr3']], columns=['Name', 'formula'])

data['formula-split'] = data['formula'].map(lambda x: split_formula(x))

data

data.to_csv('1.csv')

   0    1   2    3    4    5   6    7   8    9   10   11 12   13 14 15
0  FA  0.2  MA  0.7  APA  0.1  Pb  0.8  Sn  0.2  Cl  0.9  F  1.1  I  1

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1  2  3    4  5
0  CH  5  N  2  SnI  3

        0  1
0  MAPbBr  3

In [59]:
data = pd.DataFrame([['James', 'FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1'],['Sam', ' CH3NH3PbI3'], ['Billy', '(CH3NH3)PbI3'], ['Sarah', '(CH5N2)SnI3'], ['Felix', 'MAPbBr3']], columns=['Name', 'formula'])

data.formula

0    FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1
1                               CH3NH3PbI3
2                             (CH3NH3)PbI3
3                              (CH5N2)SnI3
4                                  MAPbBr3
Name: formula, dtype: object

In [87]:
data['formula'].apply(split_formula)

   0    1   2    3    4    5   6    7   8    9   10   11 12   13 14 15
0  FA  0.2  MA  0.7  APA  0.1  Pb  0.8  Sn  0.2  Cl  0.9  F  1.1  I  1

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1  2  3    4  5
0  CH  5  N  2  SnI  3

        0  1
0  MAPbBr  3

0    None
1    None
2    None
3    None
4    None
Name: formula, dtype: object

In [80]:
data.formula.apply(split_formula)

   0    1   2    3    4    5   6    7   8    9   10   11 12   13 14 15
0  FA  0.2  MA  0.7  APA  0.1  Pb  0.8  Sn  0.2  Cl  0.9  F  1.1  I  1

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1  2  3    4  5
0  CH  5  N  2  SnI  3

        0  1
0  MAPbBr  3

0    None
1    None
2    None
3    None
4    None
Name: formula, dtype: object

In [78]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [79]:
df.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

In [92]:
data = pd.DataFrame([['James', 'FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1'],['Sam', ' CH3NH3PbI3'], ['Billy', '(CH3NH3)PbI3'], ['Sarah', '(CH5N2)SnI3'], ['Felix', 'MAPbBr3']], columns=['Name', 'formula'])

In [116]:
data = pd.DataFrame([['James', 'FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1'],['Sam', ' CH3NH3PbI3'], ['Billy', '(CH3NH3)PbI3'], ['Sarah', '(CH5N2)SnI3'], ['Felix', 'MAPbBr3']], columns=['Name', 'formula'])

data

data.formula.apply(split_formula)

   0    1   2    3    4    5   6    7   8    9   10   11 12   13 14 15
0  FA  0.2  MA  0.7  APA  0.1  Pb  0.8  Sn  0.2  Cl  0.9  F  1.1  I  1

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1   2  3    4  5
0  CH  3  NH  3  PbI  3

    0  1  2  3    4  5
0  CH  5  N  2  SnI  3

        0  1
0  MAPbBr  3

0    None
1    None
2    None
3    None
4    None
Name: formula, dtype: object

In [119]:
def split_formula(s):
    t = re.findall(r'[\d+<\.\d+>?]+|[a-zA-Z]+',s)
    display(t)

In [120]:
Formular1 = "FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1"
split_formula(Formular1)

['FA',
 '0.2',
 'MA',
 '0.7',
 'APA',
 '0.1',
 'Pb',
 '0.8',
 'Sn',
 '0.2',
 'Cl',
 '0.9',
 'F',
 '1.1',
 'I',
 '1']

In [121]:
data = pd.DataFrame([['James', 'FA0.2MA0.7APA0.1Pb0.8Sn0.2Cl0.9F1.1I1'],['Sam', ' CH3NH3PbI3'], ['Billy', '(CH3NH3)PbI3'], ['Sarah', '(CH5N2)SnI3'], ['Felix', 'MAPbBr3']], columns=['Name', 'formula'])

data

data.formula.apply(split_formula)

['FA',
 '0.2',
 'MA',
 '0.7',
 'APA',
 '0.1',
 'Pb',
 '0.8',
 'Sn',
 '0.2',
 'Cl',
 '0.9',
 'F',
 '1.1',
 'I',
 '1']

['CH', '3', 'NH', '3', 'PbI', '3']

['CH', '3', 'NH', '3', 'PbI', '3']

['CH', '5', 'N', '2', 'SnI', '3']

['MAPbBr', '3']

0    None
1    None
2    None
3    None
4    None
Name: formula, dtype: object